{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "128"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_P_caps_weight", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "128", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_P_caps_bias", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "128", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_P_caps", 
      "attrs": {
        "kernel": "(9, 9)", 
        "num_filter": "128", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape_P_caps", 
      "attrs": {"shape": "(0, 1, 8, -1)"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square_P_caps", 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_square_P_caps", 
      "attrs": {
        "axis": "3", 
        "keepdims": "1"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar0", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div0", 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt_sum_squared_P_caps", 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div1", 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "squashed_net_P_caps", 
      "inputs": [[14, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_D_caps_weight", 
      "attrs": {
        "kernel": "(8, 1)", 
        "no_bias": "1", 
        "num_filter": "160", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_D_caps", 
      "attrs": {
        "kernel": "(8, 1)", 
        "no_bias": "1", 
        "num_filter": "160", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape_D_caps", 
      "attrs": {"shape": "(0, 10, 16, -1)"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean1_D_caps", 
      "attrs": {
        "axis": "3", 
        "keepdims": "1"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "residual_D_caps", 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square_residual_D_caps", 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar1", 
      "attrs": {"scalar": "0.001"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt_square_residual_D_caps", 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "weighted_D_caps", 
      "inputs": [[18, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "agree_D_caps", 
      "attrs": {
        "axis": "3", 
        "keepdims": "1"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square_D_caps", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_D_caps", 
      "attrs": {"axis": "(3, 2)"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax", 
      "attrs": {"axis": "1"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar2", 
      "attrs": {"scalar": "1e-08"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "log0", 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul0", 
      "inputs": [[30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean0", 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminus_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "final_agree_list", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "10", 
        "squeeze_axis": "0"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv1_1_weight", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "deconv1_1_bias", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "deconv1_1", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu1_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv2_1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconv2_1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu2_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fig_list_1_weight", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "fig_list_1", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv1_2_weight", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "deconv1_2_bias", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "deconv1_2", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 1, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu1_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv2_2_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconv2_2", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu2_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fig_list_2_weight", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "fig_list_2", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv1_3_weight", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "deconv1_3_bias", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "deconv1_3", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 2, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu1_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv2_3_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconv2_3", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu2_3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fig_list_3_weight", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "fig_list_3", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv1_4_weight", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "deconv1_4_bias", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "deconv1_4", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 3, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu1_4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv2_4_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconv2_4", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu2_4", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fig_list_4_weight", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "fig_list_4", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv1_5_weight", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "deconv1_5_bias", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "deconv1_5", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 4, 0], [72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu1_5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv2_5_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconv2_5", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu2_5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fig_list_5_weight", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "fig_list_5", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv1_6_weight", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "deconv1_6_bias", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "deconv1_6", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 5, 0], [81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu1_6", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv2_6_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconv2_6", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu2_6", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fig_list_6_weight", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "fig_list_6", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv1_7_weight", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "deconv1_7_bias", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "deconv1_7", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 6, 0], [90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu1_7", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv2_7_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconv2_7", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu2_7", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fig_list_7_weight", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "fig_list_7", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv1_8_weight", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "deconv1_8_bias", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "deconv1_8", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 7, 0], [99, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu1_8", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv2_8_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconv2_8", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu2_8", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fig_list_8_weight", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "fig_list_8", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv1_9_weight", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "deconv1_9_bias", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "deconv1_9", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 8, 0], [108, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu1_9", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv2_9_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconv2_9", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu2_9", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fig_list_9_weight", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "fig_list_9", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv1_10_weight", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "deconv1_10_bias", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "deconv1_10", 
      "attrs": {
        "kernel": "(16, 1)", 
        "num_filter": "128", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 9, 0], [117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu1_10", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "deconv2_10_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "deconv2_10", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "derelu2_10", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fig_list_10_weight", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "fig_list_10", 
      "attrs": {
        "kernel": "(28, 28)", 
        "num_filter": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "final_fig", 
      "attrs": {
        "dim": "1", 
        "num_args": "10"
      }, 
      "inputs": [[44, 0, 0], [53, 0, 0], [62, 0, 0], [71, 0, 0], [80, 0, 0], [89, 0, 0], [98, 0, 0], [107, 0, 0], [116, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape_agree", 
      "attrs": {"shape": "(0, 10, 1, 1)"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul1", 
      "inputs": [[126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum0", 
      "attrs": {
        "axis": "1", 
        "keepdims": "1"
      }, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus0", 
      "inputs": [[129, 0, 0], [0, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square0", 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean1", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "0.0005"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[34, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "final_loss", 
      "inputs": [[134, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    16, 
    31, 
    36, 
    37, 
    40, 
    43, 
    45, 
    46, 
    49, 
    52, 
    54, 
    55, 
    58, 
    61, 
    63, 
    64, 
    67, 
    70, 
    72, 
    73, 
    76, 
    79, 
    81, 
    82, 
    85, 
    88, 
    90, 
    91, 
    94, 
    97, 
    99, 
    100, 
    103, 
    106, 
    108, 
    109, 
    112, 
    115, 
    117, 
    118, 
    121, 
    124
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145
  ], 
  "heads": [[135, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10200]}
}