{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(9, 9)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {
        "kernel": "(9, 9)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(9, 9)", 
        "num_filter": "64"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_P_caps_weight", 
      "attr": {
        "kernel": "(9, 9)", 
        "num_filter": "64", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv_P_caps_bias", 
      "attr": {
        "kernel": "(9, 9)", 
        "num_filter": "64", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_P_caps", 
      "attr": {
        "kernel": "(9, 9)", 
        "num_filter": "64", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape_P_caps", 
      "attr": {"shape": "(0, 1, 8, -1)"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square_P_caps", 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_square_P_caps", 
      "attr": {
        "axis": "3", 
        "keepdims": "1"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar3", 
      "attr": {"scalar": "1"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "_div", 
      "name": "_div2", 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt_sum_squared_P_caps", 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "_div", 
      "name": "_div3", 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "squashed_net_P_caps", 
      "inputs": [[14, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv_D_caps_weight", 
      "attr": {
        "kernel": "(8, 1)", 
        "no_bias": "1", 
        "num_filter": "160", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv_D_caps", 
      "attr": {
        "kernel": "(8, 1)", 
        "no_bias": "1", 
        "num_filter": "160", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape_D_caps", 
      "attr": {"shape": "(0, 10, 16, -1)"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean1_D_caps", 
      "attr": {
        "axis": "3", 
        "keepdims": "1"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "residual_D_caps", 
      "inputs": [[18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square_residual_D_caps", 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar4", 
      "attr": {"scalar": "0.001"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt_square_residual_D_caps", 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "weighted_D_caps", 
      "inputs": [[18, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "agree_D_caps", 
      "attr": {"axis": "3"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square_D_caps", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum_D_caps", 
      "attr": {"axis": "2"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "Capsnet", 
      "attr": {"axis": "1"}, 
      "inputs": [[27, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 5, 6, 16], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29
  ], 
  "heads": [[28, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1001]}
}